driver-tests/bpelse/assign/AssignJbi/test/results/echoIntDataType_Invoke/Actual_20130319180450_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoIntDataType" xmlns:msgns="http://stc.com/echoIntDataType">
      <string>3</string>
      <normalizedString>3</normalizedString>
      <token>3</token>
      <base64Binary>3</base64Binary>
      <hexBinary>3</hexBinary>
      <integer>3</integer>
      <positiveInteger>3</positiveInteger>
      <negativeInteger>3</negativeInteger>
      <nonNegativeInteger>3</nonNegativeInteger>
      <nonPositiveInteger>3</nonPositiveInteger>
      <long>3</long>
      <unsignedLong>3</unsignedLong>
      <int>3</int>
      <unsignedInt>3</unsignedInt>
      <short>3</short>
      <unsignedShort>3</unsignedShort>
      <byte>3</byte>
      <unsignedByte>3</unsignedByte>
      <decimal>3</decimal>
      <float>3</float>
      <double>3</double>
      <boolean>3</boolean>
      <duration>3</duration>
      <dateTime>3</dateTime>
      <date>3</date>
      <time>3</time>
      <gYear>3</gYear>
      <gYearMonth>3</gYearMonth>
      <gMonth>3</gMonth>
      <gMonthDay>3</gMonthDay>
      <gDay>3</gDay>
      <Name>3</Name>
      <QName>3</QName>
      <NCName>3</NCName>
      <anyURI>3</anyURI>
      <language>3</language>
      <ID>3</ID>
      <IDREF>3</IDREF>
      <IDREFS>3</IDREFS>
      <ENTITY>3</ENTITY>
      <ENTITIES>3</ENTITIES>
      <NMTOKEN>3</NMTOKEN>
      <NMTOKENS>3</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>